#include <string>
#include "graph.h"

// --- ГРАФЫ ДЛЯ ТЕСТИРОВАНИЯ
//     генерируем граф в виде ступенчатых массивов смежности (для простоты)

enum graph_type {
    GT_0,   // простой DAG
            // 0 -> 1, 0 -> 3
            // 1 -> 5
            // 2 -> 1
            // 3 -> 5
            // 4 -> (нет исходящих)
            // 5 -> 4
    GT_1,   // более сложный DAG
            // 0 -> 3, 0 -> 4
            // 1 -> 4, 1 -> 5
            // 2 -> 5
            // 3 -> 6, 3 -> 7
            // 4 -> 6, 4 -> 8
            // 5 -> 7, 5 -> 8
            // 6 -> 9
            // 7 -> 9
            // 8 -> 9
            // 9 -> (нет исходящих)
    GT_2,   // граф с циклом (должен выдать ошибку из-за цикла)
            // 0 -> 1 -> 2 -> 0
    GT_3    // граф с компонентами сильной связности (и с циклами)
            // 0 -> 1
            // 1 -> 2, 1 -> 4, 1 -> 5
            // 2 -> 3, 2 -> 6
            // 3 -> 2, 3 -> 7
            // 4 -> 0, 4 -> 5
            // 5 -> 6
            // 6 -> 5
            // 7 -> 3, 7 -> 6
};

std::vector<std::vector<int>> create_graph(graph_type gt) {
    switch (gt) {
    case GT_0:  return {
                    {1, 3},     // 0 -> 1, 0 -> 3
                    {5},        // 1 -> 5
                    {1},        // 2 -> 1
                    {5},        // 3 -> 5
                    {},         // 4 -> (нет исходящих)
                    {4}         // 5 -> 4
                };
    case GT_1:  return {
                    {3, 4},     // 0 -> 3, 0 -> 4
                    {4, 5},     // 1 -> 4, 1 -> 5
                    {5},        // 2 -> 5
                    {6, 7},     // 3 -> 6, 3 -> 7
                    {6, 8},     // 4 -> 6, 4 -> 8
                    {7, 8},     // 5 -> 7, 5 -> 8
                    {9},        // 6 -> 9
                    {9},        // 7 -> 9
                    {9},        // 8 -> 9
                    {}          // 9 -> (нет исходящих)
                };
    case GT_2:  return {
                    {1},        // 0 -> 1
                    {2},        // 1 -> 2
                    {0},        // 2 -> 0
                    {}          // 3 изолирована
                };
    case GT_3:  return {
                    {1},        // 0 -> 1
                    {2, 4, 5},  // 1 -> 2, 1 -> 4, 1 -> 5
                    {3, 6},     // 2 -> 3, 2 -> 6
                    {2, 7},     // 3 -> 2, 3 -> 7
                    {0, 5},     // 4 -> 0, 4 -> 5
                    {6},        // 5 -> 6
                    {5},        // 6 -> 5
                    {3, 6}      // 7 -> 3, 7 -> 6
                };
    default:    return {};
    }
}

int main(int argc, char** argv)
{
    std::cout << "Программа для демонстрации топологической сортировки графов\n";

    struct graphs {
        std::string                   name{};
        std::vector<std::vector<int>> graph{};
    };
    std::vector<graphs> collection = {{
        {"простой ациклический граф",             create_graph(GT_0)},
        {"многоуровневый ациклический граф",      create_graph(GT_1)},
        {"граф с циклом (не DAG)",                create_graph(GT_2)},
        {"граф с компонентами сильной связности", create_graph(GT_3)}
    }};

    for (size_t idx = 0; idx < collection.size(); ++idx) {
        std::cout << "\n" << std::string(70, '=') << "\n";
        std::cout << "ТЕСТ: " << collection[idx].name;
        std::cout << "\n" << std::string(70, '=') << "\n\n";

        Graph graph(collection[idx].graph);
        std::cout << "исходный граф в виде вектора смежности:\n";
        graph.print();

        {
            std::cout << "\n--- АЛГОРИТМ ДЕМУКРОНА ---\n";
            auto [success, levels] = graph.demucron_sort();
            if (success) {
                std::cout << "\nУСПЕХ: топологическая сортировка алгоритмом Демукрона выполнена\n";
                levels.print_order();
                levels.print_debug();
            } else {
                std::cout << "\nОШИБКА: граф содержит цикл! топологическая сортировка алгоритмом Демукрона невозможна\n";
            }
        }

        {
            std::cout << "\n--- АЛГОРИТМ ТАРЬЯНА ---\n";
            auto [success, levels] = graph.tarjan_sort();
            if (success) {
                std::cout << "\nУСПЕХ: топологическая сортировка алгоритмом Тарьяна выполнена\n";
                levels.print_order();
                levels.print_debug();
            } else {
                std::cout << "\nОШИБКА: граф содержит цикл! топологическая сортировка алгоритмом Тарьяна невозможна\n";
            }
        }

        {
            std::cout << "\n--- АЛГОРИТМ КОСАРАЙЮ (мосты и точки сочленения) ---\n\n";
            auto scc = graph.kosaraju_scc();
            scc.print();
        }
    }

    return 0;
}
